---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallAreaBoundaryOverlap
source: html/9c28cfed-0568-e1a6-acf0-1ba9dbf1fc45.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallAreaBoundaryOverlap Property

Wall and area boundary line overlap. Color fills, area tags and areas may not behave correctly.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallAreaBoundaryOverlap { get; }
```